app/Http/Controllers/Admin/Hr/SmStaffController.php

    public function __construct()
    {

        $this->User = json_encode(User::find(1));
        $this->SmGeneralSettings = json_encode(generalSetting());
        $this->SmUserLog = json_encode(SmUserLog::find(1));
        $this->InfixModuleManager = json_encode(InfixModuleManager::find(1));
---
select * from `users` where `users`.`id` = 1 limit 1
select * from `sm_user_logs` where `sm_user_logs`.`id` = 1 limit 1
select * from `infix_module_managers` where `infix_module_managers`.`id` = 1 limit 1

    public function staffList(Request $request)
    {
        try {

            $roles = InfixRole::query();
            $roles->whereNotIn('id', [2, 3]);
            if (Auth::user()->role_id != 1) {
                $roles->whereNotIn('id', [1]);
            }
            $roles = $roles->where('is_saas', 0)
                ->where('active_status', '=', '1')
                ->where(function ($q) {
                    $q->where('school_id', Auth::user()->school_id)->orWhere('type', 'System');
                })
                ->orderBy('name', 'asc')
                ->get();
---
select * from `infix_roles` where `id` not in (2, 3) and `is_saas` = 0 and `active_status` = '1' and (`school_id` = 1 or `type` = 'System') order by `name` asc