app/Http/Controllers/Admin/StudentInfo/SmStudentAdmissionController.php

    public function index()
    {

        try {
            if (isSubscriptionEnabled() && auth()->user()->school_id != 1) {

                $active_student = SmStudent::where('school_id', Auth::user()->school_id)->where('active_status', 1)->count();

                if (\Modules\Saas\Entities\SmPackagePlan::student_limit() <= $active_student) {

                    Toastr::error('Your student limit has been crossed.', 'Failed');
                    return redirect()->back();
                }
            }

            $data = $this->loadData();
            $data['max_admission_id'] = SmStudent::where('school_id', Auth::user()->school_id)->max('admission_no');
            $data['max_roll_id'] = SmStudent::where('school_id', Auth::user()->school_id)->max('roll_no');
---
select max(`admission_no`) as aggregate from `sm_students` where `school_id` = 1 and `sm_students`.`school_id` = 1
select max(`roll_no`) as aggregate from `sm_students` where `school_id` = 1 and `sm_students`.`school_id` = 1

    public function studentDetails(Request $request)
    {
        try {
            $classes = SmClass::where('active_status', 1)
                ->where('academic_id', getAcademicId())
                ->where('school_id', Auth::user()->school_id)
                ->get();

            $students = SmStudent::where('academic_id', getAcademicId())
                ->where('school_id', Auth::user()->school_id)
                ->get();

            $sessions = SmAcademicYear::where('active_status', 1)
                ->where('school_id', Auth::user()->school_id)
                ->get();
---
select * from `sm_classes` where `active_status` = 1 and `academic_id` = 1 and `school_id` = 1 and `sm_classes`.`active_status` = 1 and `sm_classes`.`academic_id` = 1 and `sm_classes`.`school_id` = 1
select * from `sm_students` where `academic_id` = 1 and `school_id` = 1 and `sm_students`.`school_id` = 1
select * from `sm_academic_years` where `active_status` = 1 and `school_id` = 1 and `sm_academic_years`.`active_status` = 1 and `sm_academic_years`.`school_id` = 1

    public static function loadData()
    {
        $data['classes'] = SmClass::get(['id', 'class_name']);
        $data['religions'] = SmBaseSetup::where('base_group_id', '=', '2')->get(['id', 'base_setup_name']);
        $data['blood_groups'] = SmBaseSetup::where('base_group_id', '=', '3')->get(['id', 'base_setup_name']);
        $data['genders'] = SmBaseSetup::where('base_group_id', '=', '1')->get(['id', 'base_setup_name']);
        $data['route_lists'] = SmRoute::get(['id', 'title']);
        $data['dormitory_lists'] = SmDormitoryList::get(['id', 'dormitory_name']);
        $data['categories'] = SmStudentCategory::get(['id', 'category_name']);
        $data['groups'] = SmStudentGroup::get(['id', 'group']);
        $data['sessions'] = SmAcademicYear::get(['id', 'year', 'title']);
        $data['driver_lists'] = SmStaff::where([['active_status', '=', '1'], ['role_id', 9]])->where('school_id', Auth::user()->school_id)->get(['id', 'full_name']);
        $data['custom_fields'] = SmCustomField::where('form_name', 'student_registration')->where('school_id', Auth::user()->school_id)->get();
        $data['vehicles'] = SmVehicle::get();
---
select `id`, `full_name` from `sm_staffs` where (`active_status` = '1' and `role_id` = 9) and `school_id` = 1 and `sm_staffs`.`active_status` = 1 and `sm_staffs`.`school_id` = 1
select * from `sm_custom_fields` where `form_name` = 'student_registration' and `school_id` = 1 and `sm_custom_fields`.`school_id` = 1
select * from `sm_vehicles`