app/Http/Controllers/Admin/StudentInfo/SmStudentAttendanceController.php

    public function studentAttendanceImport()
    {

        try {
            $classes = SmClass::where('active_status', 1)->where('academic_id', getAcademicId())->where('school_id', Auth::user()->school_id)->get();
---
select * from `sm_classes` where `active_status` = 1 and `academic_id` = 1 and `school_id` = 1 and `sm_classes`.`active_status` = 1 and `sm_classes`.`academic_id` = 1 and `sm_classes`.`school_id` = 1