app/Helpers/Basic.php

    function userColorThemeActive(int $user_id = null)
    {
        $school_id = auth()->user()->school_id ?? 1;
        $cache_key = $user_id ? ('active_theme_user_' . $user_id) : 'active_theme_school_' . $school_id;
        $active_theme = Cache::rememberForever($cache_key, function () use ($user_id) {
            $theme = Theme::with('colors')->where('is_default', 1)
                ->when($user_id, function ($q) use ($user_id) {
                    $q->where('created_by', $user_id);
                })->first();
---
select * from `themes` where `is_default` = 1 limit 1

    function activeStyle()
    {
        if (session()->has('active_style') && session()->get('active_style')) {
            $active_style = session()->get('active_style');
            return $active_style;
        } else {
            $active_style = auth()->check() ? Theme::where('id', auth()->user()->style_id)->first() :
                Theme::where('school_id', 1)->where('is_default', 1)->first();
---
select * from `themes` where `school_id` = 1 and `is_default` = 1 limit 1

    function sidebar_menus()
    {
        $user = auth()->user();
        return $sidebars = Cache::rememberForever('sidebars' . $user->id, function () use ($user) {
            return Sidebar::with(['subModule', 'permissionInfo'])
                ->whereNull('parent')
                ->whereHas('permissionInfo', function ($q) use ($user) {
                    $q->where('menu_status', 1)
                        ->when($user->role_id == 2 || $user->role_id == GlobalVariable::isAlumni(), function ($q) {
                            $q->where('is_student', 1);
                        })->when($user->role_id == 3, function ($q) {
                            $q->where('is_parent', 1);
                        })->when(!in_array($user->role_id, [2, 3, GlobalVariable::isAlumni()]), function ($q) {
                            $q->where('is_admin', 1);
                        });
                })
                ->where('user_id', $user->id)->where('role_id', $user->role_id)->where('active_status', 1)
                ->orderBy('position', 'ASC')->get();
---
select * from `sidebars` where `parent` is null and exists (select * from `permissions` where `sidebars`.`permission_id` = `permissions`.`id` and `menu_status` = 1 and `is_admin` = 1) and `user_id` = 1 and `role_id` = 1 and `active_status` = 1 order by `position` asc

    function storePermissionData($permission, $user_id = null, $school_id = null)
    {
        Permission::updateOrCreate([
            'module' => $permission['module'],
            'sidebar_menu' => $permission['sidebar_menu'],
            'lang_name' => $permission['lang_name'],
            'icon' => $permission['icon'],
            'svg' => $permission['svg'],
            'route' => $permission['route'],
            'parent_route' => $permission['parent_route'],
            'is_admin' => $permission['is_admin'],
            'is_teacher' => $permission['is_teacher'],
            'is_student' => $permission['is_student'],
            'is_parent' => $permission['is_parent'],

            'is_saas' => $permission['is_saas'],
            'is_menu' => $permission['is_menu'],
            'status' => $permission['status'],
            'menu_status' => $permission['menu_status'],
            'relate_to_child' => $permission['relate_to_child'],
            'alternate_module' => $permission['alternate_module'],
            'permission_section' => $permission['permission_section'],
            'type' => $permission['type'],
---
select * from `permissions` where (`module` is null and `sidebar_menu` is null and `lang_name` = 'common.dashboard' and `icon` is null and `svg` is null and `route` = 'dashboard_section' and `parent_route` is null and `is_admin` = 1 and `is_teacher` = 0 and `is_student` = 0 and `is_parent` = 0 and `is_saas` = 0 and `is_menu` = 1 and `status` = 1 and `menu_status` = 1 and `relate_to_child` = 0 and `alternate_module` is null and `permission_section` = 1 and `type` is null and `user_id` = 1 and `old_id` is null and `school_id` = 1) limit 1